[{"directUrl": "https://www.yelp.com/biz/dr-jorg-peter-rabanus-san-francisco", "bizId": "K5Z1clA1LCgT0KIvqEYMig", "name": "Dr. Jorg-Peter Rabanus", "since": "", "phone": "(415) 999-6194", "amenitiesAndMore": ["Accepts Credit Cards", "Gender-neutral restrooms", "Accepts Insurance"], "operationHours": [{"day": "Mon", "regularIsClosed": false, "regularHours": ["6:00 AM - 9:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Tue", "regularIsClosed": false, "regularHours": ["6:00 AM - 9:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Wed", "regularIsClosed": false, "regularHours": ["6:00 AM - 9:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Thu", "regularIsClosed": false, "regularHours": ["6:00 AM - 9:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Fri", "regularIsClosed": false, "regularHours": ["6:00 AM - 9:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sat", "regularIsClosed": false, "regularHours": ["9:00 AM - 6:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sun", "regularIsClosed": false, "regularHours": ["9:00 AM - 6:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}], "upcomingSpecialHours": [], "website": "http://www.aesthetic-dentistry.com", "images": [{"link": "https://s3-media0.fl.yelpcdn.com/bphoto/C0CThkbG8pr5LqKhyFKtfg/258s.jpg", "alt": "Photo of Dr. Jorg-Peter Rabanus - San Francisco, CA, United States. Before and after"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/eMd4Rd39dLtlgS8HFItQ8A/258s.jpg", "alt": "Photo of Dr. Jorg-Peter Rabanus - San Francisco, CA, United States. Before and After"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/qjl5NQhFczG87dGCHqQHBw/258s.jpg", "alt": "Photo of Dr. Jorg-Peter Rabanus - San Francisco, CA, United States. Bottom left : my original smile.  Middle: after gum surgery.  Upper left: temporaries.  Right : my now beautiful smile !"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/GygbwGCUKRrfUSCYZWDb2Q/258s.jpg", "alt": "Photo of Dr. Jorg-Peter Rabanus - San Francisco, CA, United States. Mike W. Before & After, 2017"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/iiB2aZMD3PW2yHbAGXl1QA/258s.jpg", "alt": "Photo of Dr. Jorg-Peter Rabanus - San Francisco, CA, United States. Only one cosmetic dentist in SF Bay Area is accredited member on American Academy of Cosmetic Dentistry. That's dr Rabanus!"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/SghJgO0wQK3f4biSarU85w/258s.jpg", "alt": "Photo of Dr. Jorg-Peter Rabanus - San Francisco, CA, United States. Mike W. *TEMPORARIES* -- Even they looked great while waiting for the permanents! Crooked smile from being numb still!"}], "address": {"addressLine1": "121 Spear St", "addressLine2": "ste B-16", "addressLine3": "", "city": "San Francisco", "regionCode": "CA", "postalCode": "94105", "country": "US"}, "type": "Health & Medical", "primaryPhoto": "https://s3-media0.fl.yelpcdn.com/bphoto/C0CThkbG8pr5LqKhyFKtfg/l.jpg", "cuisine": "Cosmetic Dentists", "categories": ["Health & Medical", "Dentists", "Cosmetic Dentists"], "aggregatedRating": 5, "reviewCount": 58, "businessHighlights": [], "scrapeFinishedAt": "2023-04-16T14:38:52.695Z", "reviews": [{"date": "2021-05-27T00:00:00.000Z", "rating": 5, "text": "A friends took a picture of me today, and I couldn't help zoom in at my beautiful smile. So I came in here to say thank you Dr Rabanus, and to encourage anyone who  \nHas doubts to go ahead and start the process. I was one of you reading every comment, questioning the perfect score and the hype. Doing so much research, that I translated some German \n\nDr Rabanus is a master, you just need to trust his process. I was maybe one of his difficult patients. But he listened to me and answered my \"freaking out \" emails with so much grace. \n\nThank you Dr Rabanus for your mastery, and for making this world a little bit brighter with all this beautiful smiles :)", "language": "en", "isFunnyCount": 0, "isUsefulCount": 1, "isCoolCount": 0, "photoUrls": ["https://s3-media0.fl.yelpcdn.com/bphoto/qjl5NQhFczG87dGCHqQHBw/o.jpg"], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 7, "reviewerLocation": "Foster City, CA"}, {"date": "2022-01-31T00:00:00.000Z", "rating": 5, "text": "A life changing smile by Dr. Rabanus has given me incredible dividends. State of the art techniques and old-school quality craftsmanship sets Dr. Rabanus apart from others in my research. The amount of care, detail, and thoughtful preparation--making sure everything was just right. His process is clear, focused, and you immediately feel you're in the most capable of hands. If you're lucky enough to secure his services, Dr. Rabanus can not be beat.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 4, "reviewerLocation": "San Francisco, CA"}, {"date": "2020-09-08T00:00:00.000Z", "rating": 5, "text": "Permitting a bit of fun embellishment, I liken Dr. Rabanus's work to that of Johannes Brahms. Much like Brahms's mastery over many musical disciplines - symphonies, concerti, chamber music, piano music, and choral compositions - Dr. Rabanus is a master of many dentistry disciplines. As other reviewers have mentioned, upon meeting him during your first appointment and evaluation, you immediately get the sense that he's an absolute professional. After all, he is the only cosmetic dentist in San Francisco accredited by the AACD. \n\nHowever, what impressed me the most was Dr. Rabanus's skill in dealing with unexpected situations. During my first session in the chair, two of my damaged old fillings came loose and nearly crumbled away, stalling prep work for the temporary veneers. Even though we were already several hours into the procedure, Dr. Rabanus didn't miss a beat. He immediately switched gears and began prepping and filling the oral cavity. After an hour finishing up this unexpected extra work, he transitioned back to the primary procedure without breaking a sweat. Incredible. And the fillings turned out better than the original ones! \n\nIn short, Dr. Rabanus effectively communicates a clear and concise dental plan while also allowing you to be part of the process. He encourages (and expects) you to be a part of the process - engaging you at every stage to help guide the outcome of your new \"look.\" \n\nI absolutely recommend and endorse the great work of Dr. Rabanus. He will change your life.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 1, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 4, "reviewerLocation": "Oakland, CA"}, {"date": "2019-08-14T00:00:00.000Z", "rating": 5, "text": "The struggle with my teeth started many years ago. I always had crooked, gapped teeth and at a young age started developing cavities even with regular brushing and (occasional) flossing. As I got older, I started grinding my teeth in my sleep and ignored advice from multiple dentists over the years to sleep with a night guard. Over time the grinding looks its toll in a noticeable way and the enamel on my teeth was disappearing as well. I became very diligent about brushing and flossing multiple times daily, but continued having issues with cavities, yellowing, chips, and excessive wear. I went through two rounds of Invisilign which somehow made things worse since issues with the placement of my bite were never addressed, and I didn't wear a retainer for reasons I won't go into so my teeth weren't aligned for very long. Needless to say, I have always been self-conscious about them and worked hard to hide them when I smiled and when any pictures were being taken. \n\nIn late 2017, I began considering trying another round of Invisilign to straighten them again along with something like bonding to deal with the gaps, but I started to feel like I needed to make a more serious investment in a longer-term solution. This was when I turned to Yelp and started searching for a cosmetic dentist who could walk me through my options. I spoke with a couple of different dentists who were basically willing to do whatever I asked for, but then found the listing for Dr. Rabanus and read through all of the five star reviews. Not only was I intrigued, but I became emotional at the thought of finally finding a dentist who could provide an informed recommendation and help me achieve a healthy smile I could be proud of. I made an appointment for a consultation and met with him in January, 2018. \n\nTo jump right to the end, I ultimately got 20 veneers. This seemed extreme when the plan was first presented to me, but my teeth had deteriorated over many years and I knew a lot of work was needed. The roots were healthy and so were my gums so I didn't have to have any teeth totally removed or have other corrective work. I did some research to make sure veneers were the best route, and after more discussion with Dr. Rabanus felt confident that they were. He recommended I first have a \"gum lift\" (gingivectomy) to improve the look of my gum line since I had a very \"gummy\" smile and referred me to a periodontist. I had the gum lift done in March, then had to wait about six weeks for that to heal before we could proceed with the process for getting the veneers done. In the meantime, it was necessary to determine the appropriate placement for my bite since my teeth so I wore something called a deprogrammer for about four weeks. Once that was all done, the real work started and I ultimately ended up spending A LOT of time with Dr. Rabanus over the next several weeks as he worked diligently on providing me with an amazing smile. \n\nI don't think I need to go into how skilled and knowledgable Dr. Rabanus is. I think that's covered in many of the reviews here. What I will talk about is how dedicated he was to my case. He made me feel like I was his only patient by always being accessible and responsive, making appointments that were convenient for me, and spending countless hours with laser focus on making sure every tooth was dealt with in the best possible way. His precision and diligence was robot-like. I was very sensitive about how my bite felt and asked him to make a lot of tiny little adjustments, and he was more patient than any doctor or dentist has ever been with me. This was not an inexpensive endeavor and I had a lot of hesitation spending the amount of money I ultimately did for this work, but in the end it was worth it and I am thrilled with the outcome. I still check in with Dr. Rabanus from time to time and very recently reached out about a concern with one of the teeth. He responded quickly as always, made time for me, and quickly took care of the issue. I can't recommend Dr. Rabanus enough.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 9, "isCoolCount": 0, "photoUrls": ["https://s3-media0.fl.yelpcdn.com/bphoto/C0CThkbG8pr5LqKhyFKtfg/o.jpg"], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 157, "reviewerLocation": "San Francisco, CA"}, {"date": "2019-11-22T00:00:00.000Z", "rating": 2, "text": "Read his website, looked promising. Showed up at his SF office in the morning as a walk-in. Asked the receptionist for an appointment, first thing she gave me was a form to fill out - after filling it half way, I asked when I could possibly see Dr. Rabanus (as I had a bit of a dental emergency, front tooth chipped pretty badly). She seemed surprised, and said that he rarely there, and that I should just call his number directly to setup a time. The form was to see a completely different Dr. that works from that office. Not friendly or helpful, seemed annoyed that I was a \"walk-in\". So I left a voicemail for Dr. Rabanus, and did not receive a call back.", "language": "en", "isFunnyCount": 3, "isUsefulCount": 9, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 2, "reviewerLocation": "San Francisco, CA"}, {"date": "2020-07-21T00:00:00.000Z", "rating": 5, "text": "I decided to get veneers with Dr. Rabanus after being \"on the fence\" for years and having discussed the procedure with ~5 different doctors (some of whom also vouched for Dr. Rabanus as a leader in SF). I decided to go with him and ultimately am sharing this review as I am happy with the experience and would recommend:\n\n1. Up front communication/Listening - Dr. Rabanus listens to your specific needs, takes the time to answer your questions in up front consultation (many of mine were related to process/technology), and even did a photoshop mock up of my potential smile post-op. Other doctors I talked to were not as patient or willing to go in-depth with me. Additional bonus is he is very flexible to your schedule and works nights/weekends. He will make you feel confident going in.\n\n2. Quality - I have had the veneers for ~one year now and have had 0 \"non-aesthetic\" issues. No chips, no pain, no speech/breathing alteration, no bite issues, etc. Of course we all do this for cosmetics but can't take this aspect for granted. I have friends who have had pain/gum issues with other doctors.\n\n3. Design/Aesthetics - Dr. Rabanus clearly has an eye and passion for design and knows how to create a beautiful smile. He does not just put a \"cookie cutter\" mold on you and will incorporate your feedback and make modifications to temporaries to get the exact look you want. That said, it is best to work with him having a decent idea of what you want (do your own studying), as he is hesitant (rightfully so) to answer questions on \"what would look better\" and ultimately forces you to make your own decisions.\n\nCost was higher than all the others I consulted with but not egregious and I believe worth the premium that is ultimately not material when you're talking about a multi-year investment.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 70, "reviewerLocation": "Los Angeles, CA"}, {"date": "2017-11-11T00:00:00.000Z", "rating": 5, "text": "Dr. Rabanus is amazing. He's the only cosmetic dentist accredited by the American Academy of Cosmetic Dentistry in San Francisco. He very quickly becomes your friend. He cares about you as a person. You work with him directly - always. He's incredibly responsive. He's a perfectionist. He's an artist. He wants you to be absolutely satisfied with the end result and he, too, wants it to be perfect for you. You absolutely will not be disappointed! I cannot recommend him highly enough. Friends and coworkers of mine are now seriously considering cosmetic dentistry after seeing the end result on me.\n\nBefore and after pictures are included. My color shade is Ivoclar Vivadent BL3. \n\nFun Story from October 17th, 2017...\n\nI arrive at Dr. Rabanus' office around 7:30pm for a minor bite adjustment and he was finishing up a consultation with a new patient. We all ended up talking about online dating and how the new patient and his girlfriend were an online dating success story. \n\nThe new patient had the Ivoclar Vivadent color shade guide with him and some other materials, so he was looking at color selection homework and had just completed some impressions. His girlfriend looked a little nervous about her boyfriend getting cosmetic dentistry and it it looking really fake. Just dumb luck that the consultation had run a bit long into my appointment and I ended up being a living model of Dr. Rabanus' finished work. \n\nThe new patient asks me, point blank, \"if you don't mind my asking, are those veneers?\" and I replied \"well, they're crowns but the look would be the same\" and he goes \"Wow. Those look REALLY good. I want my teeth to look exactly like yours. The shape, color, length, everything.\"\n\nThe concerned look on his girlfriend's face immediately melted away. The new patient was ecstatic to see real-world example of finished work (although I suspect his girlfriend may have been MORE ecstatic). \n\nCompletely random but it was fun. I told them both that they won't be disappointed and that they're in the best of hands!\n\nWell, if you've gotten this far then I appreciate you reading my adventure and I hope that it answers any questions you may have about the procedure and Dr. Rabanus himself. \n\nIt's been a long journey for me, given the extensive damage I had done, and through that time I've found more than an immensely talented cosmetic dentist -- but also a friend. I absolutely cannot recommend him highly enough!", "language": "en", "isFunnyCount": 1, "isUsefulCount": 6, "isCoolCount": 1, "photoUrls": ["https://s3-media0.fl.yelpcdn.com/bphoto/GygbwGCUKRrfUSCYZWDb2Q/o.jpg", "https://s3-media0.fl.yelpcdn.com/bphoto/SghJgO0wQK3f4biSarU85w/o.jpg"], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 29, "reviewerLocation": "San Francisco, CA"}, {"date": "2017-08-20T00:00:00.000Z", "rating": 5, "text": "I am beyond impressed with Dr. Rabanus. After years of searching for a dentist to help me improve my smile, I came across some of the reviews for Dr. Rabanus and didn't hesitate to book a consultation. In the consultation, Dr. Rabanus listened to my concerns and desires and  came up with a plan for my teeth that I felt comfortable and excited about. I wanted something natural and ended up with 8 veneers on the top that look perfect. \n\nThroughout the process, I was blown away by the kindness and skill of Dr. Rabanus. He is not only knowledgeable, meticulous and an expert with cosmetic dentistry, but also very personable and happy to address any questions and concerns you have regarding your teeth. I literally cannot stop smiling about my new smile.\n\nI would recommend him to anyone looking to improve their teeth and smile.\n\nAn added bonus is that I was able to schedule my appointments to take place in the evenings and weekends.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 6, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 13, "reviewerLocation": "San Francisco, CA"}, {"date": "2015-05-20T00:00:00.000Z", "rating": 5, "text": "I've known my teeth were messed up for many years, but it took my wife to help me to understand that people who first met me thought I had a drug problem. I don't. So, after years of listening to dentists gently push me towards getting (expensive) porcelain veneers - and spending thousands on bonding that inevitably would discover or crack - I finally decided it was time. Shopping around, I found that each dentist had his or her own \"plan\" on how to go about it, none of which felt right to me. I can't explain why.\n\nI finally turned to my wife and said, \"If I'm going to do this, I want to find the BEST.\" So we turned to Yelp and discovered a cosmetic dentist whose reviews didn't seem real. 5 Stars across the board? Come on. Unless Dr. Jorg-Peter Rabanus has a second career as a writer capable of writing convincingly in many different voices, it seemed like I found my guy. I chose to make the next move and see if the proof was in the potato salad. \n\nWe met Dr. Rabanus at his office in downtown San Francisco. I have never had a doctor unafraid to be a real person with me, and I appreciated this (we now text to make appointments). But more so, I appreciated his deep understanding of my mouth. He had seen my x-rays before I arrived and developed a clear plan of attack for me that just made sense. Way more sense than any other dentist I'd consulted in the past. No braces needed (others said I would). A realistic 3-4 month timeline to take care of roughly... my whole mouth. And an understanding that I won't just get new teeth that look great, I'll also have the opportunity to correct my jaw and \"reset\" my mouth to its most natural home position. Never heard this one before. \n\nDr. Peter is not just a dentist. He is currently the only cosmetic dentist in San Francisco who is accredited by the American Academy of Cosmetic Dentistry, as well as a professor on the subject dedicated to teaching other dentists worldwide. He won't mention most of his accolades in person, but just read: aesthetic-dentistry.com/…. \n\nPeople fly in from all over the world to work with Dr. Peter for a reason. His attitude and professionalism are nice bonuses. The main reason is he's a master of his craft. I can say this with full confidence now after having recently completed my full consultation schedule with him. From wearing a \"deprogrammer\" for a month to set my jaw in the home position, to not experiencing any pain after nearly 6 hours in the dentists chair, you need to understand that this guy is legit. Your mouth is going to thank you. \n\nI don't always take the luxury path. I'm often totally fine buying the cheap option, as long as it serves my needs. I don't need the world to see that I drive a BMW, if I'm totally happy with a Ford. That said, for the things I use every day, like a bed or my teeth, I want a BMW. And Dr. Peter is the BMW of dentists. What the world now sees is the result of his German precision in carefully orchestrating and executing a rebuild of my mouth that now has me smiling brighter and receiving smiles just as big in return. My confidence was never low, but oh man... I didn't realize it can be boosted like this. Only problem now is that my wife is more nervous about other women looking at me! ;-) \n\nThanks, Dr. Peter. You're the best. Literally.", "language": "en", "isFunnyCount": 4, "isUsefulCount": 10, "isCoolCount": 1, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 2, "reviewerLocation": "Brooklyn, NY"}, {"date": "2015-07-21T00:00:00.000Z", "rating": 5, "text": "Dr. Rabanus combines the knowledge and precision of a scientist with the natural skills of an artist, a perfect combination when it comes to cosmetic dentistry.\n\n\"Anything short from the best is just not good enough\" - This was the mindset I had when I decided to finally \"perfect\" my smile after years unhappy with my short and uneven teeth, caused mostly by the horrendous habit of teeth grinding. I spent months looking through reviews, websites, before and after pictures, until I came across Dr. Rabanus' website. The outstanding reviews certain caught my eye but the before and after pictures were the reason that made me pick up the phone and schedule and appointment with him. \n\nFrom our first conversation over the phone I could tell he not only was extremely knowledgeable but also truly passionate about how his work in cosmetic dentistry can truly improve people's lives. During my first visit he gave me detailed and direct answers to all my questions and took the time to learn about me and my smile in order to suggest the best procedure. After discussing our oprions we decided to go with veneers. \n\nAs the ultimate perfectionist he is, Dr. Rabanus started by fixing the problem at the root: he worked with me to correct my bite so I would stop grinding my teeth. After that we moved to the fun part: pictures, impressions, more pictures, more impressions, and he worked to magically create something I thought I would never have: a perfect smile. Length, color, size, everything was perfect. I left his office smiling after my last visit and I haven't stopped smiling since then. \n\nIf you feel your smile is affecting your self steam and holding you back professionally or socially, give yourself this treat and if you want perfection, Dr. Rabanus is your guy.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 6, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 14, "reviewerLocation": "San Francisco, CA"}], "availableReviewsLanguages": [{"language": "English", "languageCode": "en", "totalReviews": 58}]}, {"directUrl": "https://www.yelp.com/biz/citident-san-francisco-2", "bizId": "GIuTvcoXppvW_GQrcZWFHg", "name": "CitiDent", "since": "", "phone": "(415) 391-4466", "amenitiesAndMore": ["All staff fully vaccinated", "Masks required", "Staff wears masks", "Accepts Credit Cards", "Free Wi-Fi", "Accepts Insurance", "Gender-neutral restrooms"], "operationHours": [{"day": "Mon", "regularIsClosed": false, "regularHours": ["9:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Tue", "regularIsClosed": false, "regularHours": ["9:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Wed", "regularIsClosed": false, "regularHours": ["9:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Thu", "regularIsClosed": false, "regularHours": ["9:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Fri", "regularIsClosed": false, "regularHours": ["9:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sat", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sun", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}], "upcomingSpecialHours": [], "website": "http://www.citidentonline.com", "images": [{"link": "https://s3-media0.fl.yelpcdn.com/bphoto/SwkV1ZAxPIiiBsyj_xzt_A/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States. Meet Dr. Jasselle."}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/CDKk1I9P0Vlk9OHV55uAcA/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States. 3D Cone Beam CT office training."}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/o0P-E1TFcaXkygHcw8y_bg/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States. Lecture at UCSF."}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/xBoHu8ca3_IspG5JxjNUYg/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States. Most amazing dental experience ever!"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/rGzffwP2qo32tQLXk-MAmA/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/HmTZ4hLS57-7gPQ0jo5KWA/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States. Front Desk"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/ELsI5YKouF9nLWfOseujpA/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/UBkJKhMfw-zppiZOU-UQNQ/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States. personal dental rooms"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/S3ePMOylqX3jTrrnr0IlnA/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States. office hallway showcases beautiful architecture"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/KqFb_7JNvu0Ztjc-HGwaZg/258s.jpg", "alt": "Photo of CitiDent - San Francisco, CA, United States"}], "address": {"addressLine1": "120 Battery St", "addressLine2": "", "addressLine3": "", "city": "San Francisco", "regionCode": "CA", "postalCode": "94111", "country": "US"}, "type": "Health & Medical", "primaryPhoto": "https://s3-media0.fl.yelpcdn.com/bphoto/SwkV1ZAxPIiiBsyj_xzt_A/l.jpg", "cuisine": "General Dentistry", "categories": ["Health & Medical", "Dentists", "General Dentistry"], "aggregatedRating": 4.5, "reviewCount": 423, "businessHighlights": [], "scrapeFinishedAt": "2023-04-16T14:38:52.965Z", "reviews": [{"date": "2023-03-24T00:00:00.000Z", "rating": 5, "text": "Dr. Jasselle is by far the best dentist I've seen. She takes her time educating patients on oral care and reviewing your gum health. I would recommend her to anyone.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 1, "reviewerLocation": "SoMa, San Francisco, CA"}, {"date": "2023-03-16T00:00:00.000Z", "rating": 5, "text": "Dr. Ngo and team are stellar at making dental appointments less scary. Everyone working there is very friendly and super helpful with any questions you might have. My first appointment with them last year was a thorough assessment of the current state of my teeth as well as tips on continued maintenance.\n\nI went for my second appointment recently and I have never had a more efficient experience for a dental visit. I was in and out of there in 20 minutes, teeth fully assessed, professionally cleaned, flossed, and mouthwashed (granted no oddities happening with my teeth)! This is honestly a new standard for how I want all of my appointments to go.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 168, "reviewerLocation": "San Francisco, CA"}, {"date": "2023-03-13T00:00:00.000Z", "rating": 5, "text": "First off, I've never been so relaxed and respected at a dentist's office  After losing my tech job in a mass layoff and moving away, I continue to visit CitiDent. It's worth the 4-hour train ride and BART trip!\n\nI thought I was properly adulting before my insurance helped me find CitiDent (I had just gotten a tech job and the office was less than a 10 minute walk). But boy, was I wrong. I wasn't even using an electric toothbrush or floss picks. My permanent retainer was super old, in poor condition, and wouldn't let me floss properly. The other one had come off years ago and I never replaced it \n\nDr. Jasselle has been amazing! She explains everything she is doing or planning to do like I'm a 5yo...cause I need it  I may have found CitiDent because I worked in tech, but I am a BIPOC and previously lived off of minimum wage. Dr. Jasselle is a true professional and doesn't judge her patients' ignorance. She wants to help them live a healthier life and be happy...so we can show off those pearly whites \n\nDr. Jasselle is so positive and outgoing...and gives me so many great tips along the way! There hasn't been an appointment where we're not laughing  The only downside is it's difficult to schedule/reschedule appointments with her sooner because she's so popular.\n\nThe front staff are amazing too! Great communicators (I was a tech recruiter, university library supervisor, and also studied conversation in a master's Linguistics program) you can tell have decades of customer service experience, are well treated, and just really enjoy coming into work. Alex (the staff member who greets you upon entrance) especially has helped me so many times with rescheduling  and answering all of my questions. When I answer my phone, his voice literally puts a smile on my phase. Alex, thanks for everything. Keep up the good work and I'll see you next time", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 4, "reviewerLocation": "San Francisco, CA"}, {"date": "2023-01-19T00:00:00.000Z", "rating": 2, "text": "I went for a first time appointment after not going to the dentist for 14 months (busy, pandemic, etc). I knew that they don't do the cleaning right away which worried me a little but the reviews were so good I thought I'll give them a try. \n\nPros: the facility is very nice, modern, clean. The camera they use to see all your teeth is cool. \n\nCons: I was shocked when the dentist told me that I have pre-periodental disease and needed to have a deep cleaning which would be painful and need anesthesia (you have to make 2 appointments - one for each side of the mouth). He also told me I need braces right away and questioned me when I told him I floss daily (I'm not a liar!). The last part was what made me question him, he was pretty patronizing. \n\nI decided to get a second opinion so I went for a cleaning at another, less fancy dentist who told me yes I had a lot of tartar build up but if I get back on regular appointments I'd be fine and I don't need the deep cleaning. \n\nI won't be back at Citident because I suspect they're just trying to squeeze money out of patients with extra unnecessary services.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 20, "reviewerLocation": "Sunnyvale, CA"}, {"date": "2023-04-01T00:00:00.000Z", "rating": 5, "text": "Going to the dentist has always been anxiety inducing until I found Dr. Amini. He really took the time to educate and explain the treatment plan, made me feel super comfortable. I was devastated to find out I needed a deep cleaning and multiple fillings but honestly couldn't believe how pleasant the whole experience was, I didn't feel any pain whatsoever and certainly didn't expect that with my pain tolerance. I'm not one to write reviews but I just had to! He's completely changed my perception towards seeing a dentist. I'd certainly come back here for all my future dental needs and have referred my friends and family to come here as well. This is somewhat of a life changing experience for someone who used to hate going to the dentist. I'm beyond grateful and so thankful for their entire staff who took such great care of me and tailored the treatment to my needs", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 8, "reviewerLocation": "Glendora, CA"}, {"date": "2023-02-20T00:00:00.000Z", "rating": 5, "text": "Awesome dentistry practice. I've seen the same dentist since childhood, and did braces and adult dental care with him, but when I moved to the west coast I needed to find someone new. I was nervous as I had high expectations. The two things I was solving for was great care and transparent pricing, and Citident has both. The team from front desk staff to the hygienists to my doctor, Dr Cabugao, are awesome. They work with you, make you feel comfortable, and give you a transparent idea around pricing so there's no surprises. Super super recommend them!!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 76, "reviewerLocation": "Dumfries, VA"}, {"date": "2023-03-26T00:00:00.000Z", "rating": 5, "text": "I've been going to CitiDent for over a year, and they are awesome! Staff are nice and professional. Moreover, their office is super dog friendly! I brought my little chihuahua in last time. The staff were happy to watch my dog while I was in the x-ray room. He could even stay on my lap when I was getting my teeth cleaned. Highly recommend to bring your dogs in, especially if you get nervous about dental treatments.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 5, "reviewerLocation": "Lomita, CA"}, {"date": "2023-02-20T00:00:00.000Z", "rating": 5, "text": "I've had the best dental visit experience here. I've been a customer for more than a year now and had many procedures since I haven't taken care of dental health seriously for so long. Dr Amini is not only caring and skilled but also he educated me a lot on taking care of my dental health.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 2, "reviewerLocation": "Seattle, WA"}, {"date": "2023-03-20T00:00:00.000Z", "rating": 5, "text": "I began going to Citident when my office was around the corner. I'm still with them today, many years later, for the professionalism and ease of being seen. The staff is courteous and efficient, which is a big help with scheduling around a busy work schedule. And Dr. Ngo is thorough and easy to talk with. Highly recommend.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 2, "reviewerLocation": "Emeryville, CA"}, {"date": "2022-09-01T00:00:00.000Z", "rating": 5, "text": "I have been seeing Dr Amini since 2006, for everything from routine checkups to crowns to minor aesthetic touch ups. He and his staff are excellent. They take pride in the quality of their work and the way they treat their patients.\n\nThis includes being as up-front and transparent about pricing as they can be given our Byzantine insurance system. More than once they have helped me figure out the best treatment plan and timing to minimize out of pocket costs without sacrificing having the right work done. \n\nMy dad is a dental specialist and so I have been in many dental offices over the years, and heard many more stories about how dentists run their practices. I am confident saying that Dr. Amini is in the top tier. I highly recommend him and his team at CitiDent.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 45, "reviewerLocation": "San Anselmo, CA"}], "availableReviewsLanguages": [{"language": "English", "languageCode": "en", "totalReviews": 423}, {"language": "Spanish", "languageCode": "es", "totalReviews": 1}]}, {"directUrl": "https://www.yelp.com/biz/michael-j-perona-dds-san-francisco-4", "bizId": "M8YOrhkNnE0ezzPEjPoeHg", "name": "Michael J Perona, DDS", "since": "", "phone": "(415) 546-7990", "amenitiesAndMore": ["All staff fully vaccinated", "Masks required", "Staff wears masks", "Accepts Credit Cards", "Free Wi-Fi", "Accepts Insurance", "LGBTQ-owned"], "operationHours": [{"day": "Mon", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:30 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Tue", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:30 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Wed", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Thu", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:30 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Fri", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sat", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sun", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}], "upcomingSpecialHours": [], "website": "http://www.sfteeth.com", "images": [{"link": "https://s3-media0.fl.yelpcdn.com/bphoto/XkwOoBCKrsgjIvfMHMG40w/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/f5jdCPGxQGjC083exxDweA/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/-YbBqMSBL2lyKzKBNGACkA/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/YK2-6ZTgJPDwJ-0NnAheMg/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/ABssi3WC0-g9UejtzatOcg/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/wgGSPxWcJ1MeV64fo9Zi9Q/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/c0a7mfLul0YGTpz5vItLhw/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States. Outside. It's down a short alley so be sure to keep walking to the end"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/lht29mPOK703VA0XfZobjg/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/k0T8yLnFpRT2dOnLYH2GZA/258s.jpg", "alt": "Photo of Michael J Perona, DDS - San Francisco, CA, United States"}], "address": {"addressLine1": "188 Spear St", "addressLine2": "Ste 105", "addressLine3": "", "city": "San Francisco", "regionCode": "CA", "postalCode": "94105", "country": "US"}, "type": "Health & Medical", "primaryPhoto": "https://s3-media0.fl.yelpcdn.com/bphoto/XkwOoBCKrsgjIvfMHMG40w/l.jpg", "cuisine": "General Dentistry", "categories": ["Health & Medical", "Dentists", "General Dentistry"], "aggregatedRating": 5, "reviewCount": 68, "businessHighlights": [], "scrapeFinishedAt": "2023-04-16T14:38:53.094Z", "reviews": [{"date": "2019-02-08T00:00:00.000Z", "rating": 5, "text": "I've been a patient for over 15 years! Location is not ideal, as I come on my days off.  However, it's worth it to be treated by Dr. Perona and his awesome staff! \n\nDr. Perona was responsible to recommend a great oral surgeon for my implant and helped to alleviate my concerns about the procedure.\n\nThank you Dr. Perona and everyone on the staff for your hard work and dedication to your clients!  \n\nWishing you all the best for 2019.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 1, "reviewerLocation": "San Francisco, CA"}, {"date": "2021-10-25T00:00:00.000Z", "rating": 1, "text": "terrible front desk service, assumed that every customer is familiar with the system and was angry when asked questions", "language": "en", "isFunnyCount": 0, "isUsefulCount": 5, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 2, "reviewerLocation": "SoMa, San Francisco, CA"}, {"date": "2020-12-08T00:00:00.000Z", "rating": 5, "text": "Was looking for a new dentist and was referred to Dr. Perona. I was super impressed with he and his staff's level of professionalism, friendliness and skill! \nThank you!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 43, "reviewerLocation": "San Rafael, CA"}, {"date": "2020-08-17T00:00:00.000Z", "rating": 5, "text": "Great office located directly in downtown SF. The front desk staff is so friendly and nice! Everything was on time. The team was very professional examining and providing with solutions by priority. I had a complicated situation with the implants and Dr. Michael Perona replaced them with a new set. This is a great place to go take care of your teeth. They explained very well what was going on. The best dental care I have ever experienced and I will be coming here for all my future dental needs. Thanks to all the team!!!", "language": "en", "isFunnyCount": 1, "isUsefulCount": 1, "isCoolCount": 1, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 1, "reviewerLocation": "Chinatown, San Francisco, CA"}, {"date": "2020-12-04T00:00:00.000Z", "rating": 5, "text": "Dr. Perona is an excellent dentist. In the years I have been seeing him I have always gotten the very best of care. He carefully explains his plans for treatment before starting and makes sure I experience no unnecessary pain.\nIn addition, the personnel in this office, Gigi and Yolanda, are both \"top of the line\".\nIn short, the members of this medical practice treat me like family. I have absolutely NO complaints and highly recommend them.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 2, "reviewerLocation": "San Francisco, CA"}, {"date": "2016-08-24T00:00:00.000Z", "rating": 5, "text": "Patient with Dr. P for 4 years in SF then moved to NYC for 4 years, then came back and no doubt who my dentist would be. As long as I work in SOMA, I'm going to Dr. Perona. He's honest, his staff (Monica at the front desk, all the hygienists) are a pleasure. \n\nI've never felt upsold, they've always worked to treat cavities or near-cavities without drilling if possible. Also, did a teeth whitening there and it was great, need to set up another session because I drink way too much coffee! Anyway, the office is super clean, in a great location in SOMA and like I said, you won't be upsold and you'll feel like family.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 7, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 258, "reviewerLocation": "San Rafael, CA"}, {"date": "2020-02-02T00:00:00.000Z", "rating": 5, "text": "Blown away by my experience - excellent Dentist office! Every single person I met including the receptionist, hygienist, radiologist and Dr. Perona himself were incredibly kind, friendly and informative. I am a new patient and even so, I felt valued and cared for each step of the way. I also walked away with great tips and insight into my dental care. I would absolutely recommend this office to a friend!!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 1, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 13, "reviewerLocation": "San Francisco, CA"}, {"date": "2020-05-19T00:00:00.000Z", "rating": 5, "text": "Fantastic Dental Service!  Friendly Staff are all trained on the most up-to-date procedures and equipment.  I enjoy going here.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 6, "reviewerLocation": "San Francisco, CA"}, {"date": "2021-03-16T00:00:00.000Z", "rating": 5, "text": "If you're anything like me, visits to the dentist are typically a nerve rattling experience, but was my best experience ever.  The facilities are high-tech and extremely clean.  Dr Perona and everyone in his office was very friendly, patient and understanding.   I broke a crown and they got me in quickly and made and installed a new crown within 2 hours while I waited.  It was a painless, quick and pleasant experience.  I cant recommend them enough.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 17, "reviewerLocation": "Walnut Creek, CA"}, {"date": "2018-10-15T00:00:00.000Z", "rating": 5, "text": "Clean offices, Amazing and personal staff and the best Dentist ever, gentle and effective and super knowledgeable.\nI have been coming here after several unsuccessful dental try outs, he's suburb.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 16, "reviewerLocation": "San Francisco, CA"}], "availableReviewsLanguages": [{"language": "English", "languageCode": "en", "totalReviews": 68}]}, {"directUrl": "https://www.yelp.com/biz/rincon-dental-san-francisco", "bizId": "qcQ19uqC0wPlJIrL3o_fYw", "name": "Rincon Dental", "since": "", "phone": "(415) 974-6722", "amenitiesAndMore": ["Gender-neutral restrooms"], "operationHours": [{"day": "Mon", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Tue", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Wed", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Thu", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Fri", "regularIsClosed": false, "regularHours": ["8:30 AM - 4:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sat", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sun", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}], "upcomingSpecialHours": [], "website": "http://www.rincondental.com", "images": [{"link": "https://s3-media0.fl.yelpcdn.com/bphoto/ntB-m_J-QMwQZqSFYarewg/258s.jpg", "alt": "Photo of Rincon Dental - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/L3ics-3zuj1yV6qhbOnNlw/258s.jpg", "alt": "Photo of Rincon Dental - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/CKMPwTYwWugEtgNXHAHQrQ/258s.jpg", "alt": "Photo of Rincon Dental - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/80nVtcD_8WvmXRoBMx4Srg/258s.jpg", "alt": "Photo of Rincon Dental - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/M1x2F2HNWr8-pdD_LFwnnQ/258s.jpg", "alt": "Photo of Rincon Dental - San Francisco, CA, United States"}], "address": {"addressLine1": "121 Spear St", "addressLine2": "Ste B16", "addressLine3": "", "city": "San Francisco", "regionCode": "CA", "postalCode": "94105", "country": "US"}, "type": "Health & Medical", "primaryPhoto": "https://s3-media0.fl.yelpcdn.com/bphoto/ntB-m_J-QMwQZqSFYarewg/l.jpg", "cuisine": "General Dentistry", "categories": ["Health & Medical", "Dentists", "General Dentistry"], "aggregatedRating": 4.5, "reviewCount": 114, "businessHighlights": [], "scrapeFinishedAt": "2023-04-16T14:38:59.985Z", "reviews": [{"date": "2022-10-22T00:00:00.000Z", "rating": 5, "text": "I've been a patient for 8 years. My wife is now a patient at Rincon Dental as well. Excellent staff, great dental work and a very friendly atmosphere. I've never really looked forward to going to the dentist, but now I always look forward to my bi-annual cleaning at Rincon because I receive the best care in the world when I'm in the chair.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 1, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 172, "reviewerLocation": "San Francisco, CA"}, {"date": "2023-03-23T00:00:00.000Z", "rating": 5, "text": "Professional, friendly, competent, organized. No edits. They have been a great dental practice over the years.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 7, "reviewerLocation": "San Francisco, CA"}, {"date": "2022-06-23T00:00:00.000Z", "rating": 4, "text": "I work upstairs and Dr Byun was highly recommended by colleagues. I've been to this office a couple times now, and each time I walk away satisfied with my experience.\n\n1. I appreciate Dr Byun's honesty and transparency. Understanding that your avg joe can't tell the difference between serious / moderate / light decay when looking at an x ray, it's easy for providers to over treat to pad their bottom line. I had a bunch of dental work done during covid at a provider in SD. Today when I saw Dr B he told me it was unnecessarily aggressive and to not go back. His candor and honesty was refreshing and makes me want to continue going back for treatment.\n\n2. Scheduling is generally a breeze and reception is very friendly. I requested an apt online and got a response within an hour. I docked a star bc I had asked to reschedule given a last minute work conflict, but they charge a pretty hefty $120 for cancellations / reschedules without 24 hrs prior notice. It's steep compared to other providers, but I suppose understandable given the location in DTSF.\n\n3. Hygienist was thorough, positive, and friendly. Also, use coco floss people! \n\nThanks Dr B and co. Looking forward to my next visit!", "language": "en", "isFunnyCount": 1, "isUsefulCount": 1, "isCoolCount": 1, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 87, "reviewerLocation": "San Diego, CA"}, {"date": "2022-10-08T00:00:00.000Z", "rating": 5, "text": "I have trust issues when it comes to dentists cause it always feels like they're pushing procedures that don't really need to be done. This was the first dentist ever where I actually felt like they knew what they were doing! Everything was very streamlined, you're in n out of there so fast. Everyone is very friendly and talkative. And its also like super close to where I work. Somehow they could tell where I work cause each person kept guessing it right ha! Is it really that apparent?", "language": "en", "isFunnyCount": 0, "isUsefulCount": 2, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 1217, "reviewerLocation": "San Francisco, CA"}, {"date": "2022-04-20T00:00:00.000Z", "rating": 5, "text": "I've been going to Rincon Dental for probably 7+ years. The staff is super friendly, place is clean, and Dr.Byun really cares about his patients. Mia who has worked there for years is such a sweetheart. Love her. I've had a few fillings and Dr.Byun was gentle with the numbing and drilling process. Still nerve wracking but overall not bad. \n    Also, I'm in the process of Invisalign with an orthodontist; and, they both have been working together for my Invisalign situation. Dr. Byun is on top of emailing and calling me personally to discuss the situation. This level of service is what keeps me coming back. Rincon Dental truly cares about their patients. \n    Parking can be tough but the professionalism & customer care surpasses having to circle around to find parking! I highly recommend Rincon Dental. I would give this place more than 5 stars.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 1, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 36, "reviewerLocation": "San Francisco, CA"}, {"date": "2022-08-19T00:00:00.000Z", "rating": 5, "text": "This has been my dental office since I moved to San Francisco in 2000.  Dr. Opper and now Dr. Byun are terrific dentists and I have always received top notch, excellent care at Rincon Dental.  They also have the most amazing, professional staff who care about you and take great care of you.  Is it appropriate to also mention that everyone who works here is good looking ?", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 130, "reviewerLocation": "San Francisco, CA"}, {"date": "2021-10-19T00:00:00.000Z", "rating": 1, "text": "[edit] I stand by my impression. Whether or not the receptionist was racist, a 3rd person cannot decide what it was especially when he wasn't even at the scene. At your office, I felt discriminated against and I felt that was undeserved. Also, I would never return to this business. Thank you. \n\nI had called the office to schedule for an appointment multiple times in the past and never received a call back so I decided to walk into the office. Mia was at the front desk asking how I came in. I said that I am looking to make an appointment because I have a cavity that needs to be filled. She then asked how do I know that I have them. I said, because I went to the dentist for regular cleaning two weeks ago and they confirmed that I do. She then asked \"why wouldn't you get them filled there?\" Oh, I am sorry - I am bringing you more business but you are questioning why I am at your office? Her condescending remarks went on. \"How do you know for sure you have them?\" \"We can't just blindly take your word for it.\" I never asked that they do! \n\nI guess Mia just couldn't believe that I would want their service because of the positive reviews. When I asked her why is she so hostile towards me trying to make an appointment, she said \"I'm sorry, I wasn't expecting you!\" I asked, \"do you not accept walk-in patients?\" She said \"we do. I just wasn't expecting you to walk-in when you did!\" \n\nOh. I was speechless. All I could do was to walk out of the office. Looking back, I'm not sure what it was. I'm an Asian female so I guess it could be racism  or sexism against your own gender. Oh, I just recalled. Mia was quite nice to the white lady who came in for an appointment. \n\nP.S. walk-in (According to dictionary.com) \n\nA noun. A person, as a customer, patient, or interviewee, who arrives without an appointment.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 2, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 3, "reviewerLocation": "San Francisco, CA"}, {"date": "2022-08-05T00:00:00.000Z", "rating": 5, "text": "Always a pleasant visit for the last 20 years. Dr. Bynun and staff are the best. Facility is clean and Covid compliant.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 11, "reviewerLocation": "Pacifica, CA"}, {"date": "2022-02-26T00:00:00.000Z", "rating": 1, "text": "this practice has really gone downhill in the past year.  just had my cleaning/check up done yesterday and was really not happy with the \"service\".  hygenist did a half*ss job of cleaning -- used the scaler for a couple of minutes, then a few minutes with manual scraping.  \"polishing\" was running the machine a couple of minutes outside my mouth (really??) then briefly ran it over a couple of teeth.  \"dentist\" came in, pulled at my lips so hard that it hurt, visibly \"inspected\" my teeth for a couple of seconds and said I was \"good to go\".\ni won't be back\nsuggest you don't patronize them either", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 82, "reviewerLocation": "Denver, CO"}, {"date": "2022-04-19T00:00:00.000Z", "rating": 5, "text": "Referred by a friend. Really enjoyed my experience here. The cleaning was very thorough but also one of the most painless I've ever had, the dental hygienist had a very soft touch. The dentist took X-rays and gave a thorough exam of my teeth and was very understanding about my anxieties re going to the dentist. Beautiful experience 10/10", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 20, "reviewerLocation": "New York, NY"}], "availableReviewsLanguages": [{"language": "English", "languageCode": "en", "totalReviews": 114}]}, {"directUrl": "https://www.yelp.com/biz/zen-dental-studio-san-francisco-2", "bizId": "zkltg1-4KA8Rxo1eWU5AbQ", "name": "Zen Dental Studio", "since": "", "phone": "(415) 857-0150", "amenitiesAndMore": ["Staff wears masks", "Masks required", "Accepts Credit Cards", "Free Wi-Fi", "Accepts Insurance", "Women-owned"], "operationHours": [{"day": "Mon", "regularIsClosed": false, "regularHours": ["8:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Tue", "regularIsClosed": false, "regularHours": ["8:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Wed", "regularIsClosed": false, "regularHours": ["9:00 AM - 6:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Thu", "regularIsClosed": false, "regularHours": ["9:00 AM - 6:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Fri", "regularIsClosed": false, "regularHours": ["8:00 AM - 5:00 PM"], "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sat", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}, {"day": "Sun", "regularIsClosed": true, "regularHours": null, "hasSpecialHours": false, "specialIsClosed": null, "specialHours": null}], "upcomingSpecialHours": [], "website": "https://www.zen.dentist", "images": [{"link": "https://s3-media0.fl.yelpcdn.com/bphoto/fJhcXC0FeMaSRIvso_gK3Q/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/-CVFLT7tC-wViVdbSkPRCg/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/DGTqSa3ookW9xg0ORditfQ/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/KgGxABDsRNu4dIuBCC79vA/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/xk9u5GhMEvUTF5IKtj4GGQ/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States. Hallway"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/01t1q9l5Ik6PZaPeVHNkyA/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States. We've designed a modern space to serve as an oasis of escape."}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/MWYg7miO9aNTc9uvX7oqRw/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States. An ancient mandala from Nepal greets patients as they walk into the office."}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/ftGe_k4iaF73e_aPDbWc6g/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States. Dr. Pokhrel's passions for dentistry and mindfulness inspired her to establish Zen Dental Studio."}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/jiCmsT8R_-OO9nXZtVqKNw/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States"}, {"link": "https://s3-media0.fl.yelpcdn.com/bphoto/REdcGxqUuSWIUOCXEIa0LQ/258s.jpg", "alt": "Photo of Zen Dental Studio - San Francisco, CA, United States"}], "address": {"addressLine1": "254 5th St", "addressLine2": "", "addressLine3": null, "city": "San Francisco", "regionCode": "CA", "postalCode": "94103", "country": "US"}, "type": "Health & Medical", "primaryPhoto": "https://s3-media0.fl.yelpcdn.com/bphoto/fJhcXC0FeMaSRIvso_gK3Q/l.jpg", "cuisine": "General Dentistry", "categories": ["Health & Medical", "Dentists", "General Dentistry"], "aggregatedRating": 5, "reviewCount": 118, "businessHighlights": ["Locally owned &amp; operated", "Certified professionals", "5 years in business", "Offers customized solutions", "Women-owned &amp; operated", "Consultations available"], "scrapeFinishedAt": "2023-04-16T14:39:03.720Z", "reviews": [{"date": "2023-01-14T00:00:00.000Z", "rating": 5, "text": "I am extremely pleased with the fillings done by Dr. Carpenter last week.\n\nIt was a pleasant experience from the moment I entered into the dental studio. There is no doubt that Dr. Pokhrel's team is amazing and her studio setup is a modern classic.\n\nI had an unpleasant dental experience in the past and was nervous to visit a dental clinic after that. However, my wife encouraged me to visit this place once.\n\nI appreciate the way Dr. Carpenter listened to my concerns and explained the treatment plan in detail.\nThe procedure was smooth and painless, and I can already see a noticeable improvement in my dental health.\n\nI highly recommend Zen Dental Studio to anyone in need of dental care.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 1, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 13, "reviewerLocation": "San Francisco, CA"}, {"date": "2023-04-13T00:00:00.000Z", "rating": 5, "text": "Loved my experience here! The office is clean, and all the staff are so kind and accommodating. I honestly can't wait to come back!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 10, "reviewerLocation": "Salt Lake City, UT"}, {"date": "2022-04-01T00:00:00.000Z", "rating": 5, "text": "You won't find a cuter dental office with great dentists in SOMA! \n\nI am a new patient through Cigna and came in for a standard 6mo cleaning and was in and out of there in less than 2 hours which is really important to me as I have a busy schedule and cannot usually come in on the weekends. I had x-rays and a cleaning done and it was all very painless! *Disclaimer though I enjoy going to the dentist and have never had any teeth problems in my life.* I had Dr. Nina and she was super nice and when the x-ray machine was being used sped up the process and did my gum measurements while I was waiting! Her assistant was also very nice and helpful. They both seemed like they were younger which was very pleasant, all dentists I've had in the past are usually 50/60+ so it was refreshing. \n\nThe aesthetic of the studio is very focused on zen! They have all the matching decor, a massage chair (!!!!! yes when you're getting your teeth cleaned), and all the little touches that match such as the little goody bag having a mindfulness card. Isn't that just so cute?!\n\nI was 20 minutes late and they still took me, not recommending that but just wanted to point out that they are very accommodating. No parking lot, street only. \n\nThanks ladies!", "language": "en", "isFunnyCount": 1, "isUsefulCount": 1, "isCoolCount": 1, "photoUrls": ["https://s3-media0.fl.yelpcdn.com/bphoto/jiCmsT8R_-OO9nXZtVqKNw/o.jpg"], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 118, "reviewerLocation": "San Francisco, CA"}, {"date": "2023-03-19T00:00:00.000Z", "rating": 5, "text": "Zen Dental Studio is the fanciest dental office I've been to. I love their chairs, comfy and soft! Staff was also amazing, extremely helpful, and were quick to respond to any messaging. Highly recommend!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 6, "reviewerLocation": "San Diego, CA"}, {"date": "2023-02-23T00:00:00.000Z", "rating": 5, "text": "First, I was stressed in being on time for my appointment because the Muni line was not functioning. I ended up walking at a fast pace and was only 3 minutes late. Once I sat in the massage chair feeling the roller go over my back, I relaxed. Also, the staff that checked me in was calm which helped me relaxed.\n\nI've been going to Zen Dental for a couple of years now. Dr. Nina and the Dental Hygienists that have worked on my teeth are excellent. They are knowledgeable, professional and caring. I will keep returning to Zen Dental.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 3, "reviewerLocation": "Belmont, CA"}, {"date": "2023-02-03T00:00:00.000Z", "rating": 5, "text": "I've been coming to Dr. Pokhrel at Zen Dental Studio since we moved to San Francisco four years ago. A friend recommended her to me, and I'm so glad he did! With some other dentists, I feel like treatment is being forced on me, but never with Dr. Pokhrel. She is always upfront about whether I need the treatment now (and clearly explains why) or whether it can wait. It's great to know that I can trust my dentist in this way. Also, the level of dedication and time she spends with you is something I've rarely experienced with a dentist. The whole team is super professional and lovely to deal with. I've recommended Zen Dental Studio to lots of friends without hesitation, and can honestly say my teeth have never been better!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 4, "reviewerLocation": "San Francisco Bay Area, CA"}, {"date": "2023-01-31T00:00:00.000Z", "rating": 5, "text": "This is hands down the best dentist I've had. I have been coming here for a while now and the location, staff, assistants, and dentist are all amazing. And its literally in the name, but this place really is Zen! They put in such effort to make patients feel comfortable.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 8, "reviewerLocation": "Seattle, WA"}, {"date": "2022-11-10T00:00:00.000Z", "rating": 5, "text": "Everyone at Zen Dental is so professional and kind. I'm in excellent hands!\n\nIt is far from the classic shame and blame bald old days of dental visits at practices which shall remain nameless.", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 13, "reviewerLocation": "San Francisco, CA"}, {"date": "2022-11-04T00:00:00.000Z", "rating": 5, "text": "This was my first visit at Zen Dental and I'm so impressed! Despite a small miscommunication regarding insurance earlier, the admin team resolved everything graciously. The facility itself was so clean and well-designed - the dental chairs even have massaging capabilities! Alexis - my hygienist- was super friendly and explained the different tools and processes as they were used. Dr. Braun was also very thorough and patient. Both asked me questions regarding health concerns and gave really informative and helpful answers. Highly recommend!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": ["https://s3-media0.fl.yelpcdn.com/bphoto/be8DTGFH2N73BZ-De6bB6A/o.jpg"], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 11, "reviewerLocation": "Evanston, IL"}, {"date": "2022-09-01T00:00:00.000Z", "rating": 5, "text": "I've been a patient at Zen Dental Studio for 3-4 years now, and I'm so happy I found them. I've always gotten the greatest care I could have hoped for, and everyone working there is extremely professional and kind. The office is really nice as well, and I love the relaxing seats, I even thought I could fall asleep a couple of times, despite being, well, at the dentist's!", "language": "en", "isFunnyCount": 0, "isUsefulCount": 0, "isCoolCount": 0, "photoUrls": [], "reviewerName": null, "reviewerUrl": null, "reviewerReviewCount": 7, "reviewerLocation": "San Francisco, CA"}], "availableReviewsLanguages": [{"language": "English", "languageCode": "en", "totalReviews": 118}]}]